pokedex-rails-backend/app/controllers/api/items_controller.rb

    def destroy
        @item = Item.find_by(id: params[:id])

        if @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]